///////////////////////////////////////////////////////////////////////////////
//
// FloatType.h
//  
// 4DClass Developer
// Copyright (c) 4DClass. All rights reserved.
//
///////////////////////////////////////////////////////////////////////////////

#ifndef _FLOAT_TYPE_H_
#define _FLOAT_TYPE_H_

////////////////////////////////////////////////////////////////////////////////
//
//全局单精度浮点类型定义
//
////////////////////////////////////////////////////////////////////////////////

//单精度浮点型
typedef float                                               _FLOAT;

//单精度浮点数组
typedef _FLOAT                                              _FLOAT2[2];
typedef _FLOAT                                              _FLOAT3[3];
typedef _FLOAT                                              _FLOAT4[4];

//单精度浮点数组
typedef _FLOAT                                              _FLOAT22[2][2];
typedef _FLOAT                                              _FLOAT33[3][3];
typedef _FLOAT                                              _FLOAT44[4][4];

////////////////////////////////////////////////////////////////////////////////
#endif //_FLOAT_TYPE_H_
